In [1]:
import pandas as pd

In [2]:
crops = pd.read_csv("crops.csv")
df = pd.DataFrame(crops)
df

             crop     year   area     msp  yields
0            rice  2014-15  15759    1360  378216
1            rice  2015-16  15987    1414  383688
2            rice  2016-17  15747    1470  377928
3            rice  2017-18  15958    1550  382992
4            rice  2018-19  15848    1750  380352
..            ...      ...    ...     ...     ...
95  errachandanam  2014-15      5  150000      10
96  errachandanam  2015-16      5  160000      10
97  errachandanam  2016-17      9  190000      10
98  errachandanam  2017-18     10  195000      10
99  errachandanam  2018-19     12  209000      10

[100 rows x 5 columns]

In [3]:
iris = pd.read_csv(
    "iris.data",
    names=["sepal_length", "sepal_width", "petal_length", "petal_width", "class"],
)
iris_df = pd.DataFrame(iris)
iris_df

     sepal_length  sepal_width  petal_length  petal_width           class
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [4]:
sampleexcel = pd.read_excel("sampleexcel.xlsx")
sampleexcel_df = pd.DataFrame(sampleexcel)
sampleexcel_df

,FL_DATE,OP_UNIQUE_CARRIER,OP_CARRIER_FL_NUM,ORIGIN,DEST,DEP_DELAY,ARR_DELAY,CANCELLED,ACTUAL_ELAPSED_TIME
0,2019-01-01,9E,5246,MSP,MKE,33,8,0,64
1,2019-01-01,9E,5249,ATL,PHF,8,-5,0,90
2,2019-01-01,9E,5249,PHF,ATL,-6,-2,0,121
3,2019-01-01,9E,5250,MSP,CLE,10,-5,0,102
4,2019-01-01,9E,5254,MSP,RDU,-5,-27,0,139
...,...,...,...,...,...,...,...,...,...
194,2019-01-01,AA,459,SEA,PHX,-1,33,0,206
195,2019-01-01,AA,460,PHX,ORD,3,-5,0,204
196,2019-01-01,AA,461,MCO,CLT,11,9,0,104
197,2019-01-01,AA,462,PHX,ATL,-2,-2,0,206
198,2019-01-01,AA,463,MCO,PHX,8,7,0,284

In [5]:
student_mat= pd.read_csv("student-mat.csv", sep=";")
student_mat_df = pd.DataFrame(student_mat)
student_mat_df

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,services,services,...,5,5,4,4,5,4,11,9,9,9
391,MS,M,17,U,LE3,T,3,1,services,services,...,2,4,5,3,4,2,3,14,16,16
392,MS,M,21,R,GT3,T,1,1,other,other,...,5,5,3,3,3,3,3,10,8,7
393,MS,M,18,R,LE3,T,3,2,services,other,...,4,4,1,3,4,5,0,11,12,10
394,MS,M,19,U,LE3,T,1,1,other,at_home,...,3,2,3,3,3,5,5,8,9,9

In [6]:
cricketdata=pd.read_csv('https://github.com/abhikalparya/cricket-data-analytics/blob/main/t20-csv-files/fact_bating_summary.csv?raw=true')
cricketdata_df=pd.DataFrame(cricketdata)
cricketdata_df

,match,teamInnings,battingPos,batsmanName,runs,balls,4s,6s,SR,out/not_out,match_id
0,Namibia Vs Sri Lanka,Namibia,1,Michael van Lingen,3,6,0,0,50.00,out,T20I # 1823
1,Namibia Vs Sri Lanka,Namibia,2,Divan la Cock,9,9,1,0,100.00,out,T20I # 1823
2,Namibia Vs Sri Lanka,Namibia,3,Jan Nicol Loftie-Eaton,20,12,1,2,166.66,out,T20I # 1823
3,Namibia Vs Sri Lanka,Namibia,4,Stephan Baard,26,24,2,0,108.33,out,T20I # 1823
4,Namibia Vs Sri Lanka,Namibia,5,Gerhard Erasmus(c),20,24,0,0,83.33,out,T20I # 1823
...,...,...,...,...,...,...,...,...,...,...,...
694,Pakistan Vs England,England,3,Phil Salt,10,9,2,0,111.11,out,T20I # 1879
695,Pakistan Vs England,England,4,Ben Stokes,52,49,5,1,106.12,not_out,T20I # 1879
696,Pakistan Vs England,England,5,Harry Brook,20,23,1,0,86.95,out,T20I # 1879
697,Pakistan Vs England,England,6,Moeen Ali,19,13,3,0,146.15,out,T20I # 1879
698,Pakistan Vs England,England,7,Liam Livingstone,1,1,0,0,100.00,not_out,T20I # 1879